Revit 2027 API
IExternalDataManagerServer.GetData Method
 Obtains the data.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
IList<ExternalDataManagerDataItem> GetData(
	Document document
)
Function GetData (
	document As Document
) As IList(Of ExternalDataManagerDataItem)
IList<ExternalDataManagerDataItem^>^ GetData(
	Document^ document
)
abstract GetData :
        document : Document -> IList<ExternalDataManagerDataItem>
Parameters
document Document
 The document..
Return Value
IList<ExternalDataManagerDataItem>
 Empty if the server has no data.
Remarks
 Revit requests the data whenever the Manage Links dialog needs to populate or refresh its table. Implementations should return the full, up-to-date set, even if only a subset has changed, because the UI performs its own diff to minimize redraws. Performance tips: Avoid heavy I/O inside this call; maintain a lightweight in-memory cache and refresh it asynchronously where possible. The array may be large; reserve capacity when building it to avoid excessive reallocations.
See Also
Reference
IExternalDataManagerServer Interface
Autodesk.Revit.UI Namespace